{
    "title": "Introduction",
    "presentation": "<p>My name is Maximilien Nadji, I am a Linux System Administrator fostering the DevOps culture.<br>I maintain a <a href=\"/blog\">blog</a> containing articles on freelancing, Linux, and DevOps, where I share insights.</p>",
    "services": "<ul class=\"services-list\"><li class=\"service\"><strong>User & Group Management:</strong> Create, configure, and manage local user accounts, group permissions, resource limits, and ACLs.</li><li class=\"service\"><strong>Job Scheduling & Automation:</strong> Manage and schedule recurring tasks and command executions.</li><li class=\"service\"><strong>Disk & Storage Management:</strong> Configure and manage disk partitions, LVM storage, swap space, filesystems, and automounting.</li><li class=\"service\"><strong>System Recovery:</strong> Efficiently recover from hardware, OS, or filesystem failures.</li><li class=\"service\"><strong>Network Configuration:</strong> Set up packet filtering, IPv4/IPv6 networking, port redirection, NAT, static/dynamic routing, and SSH access.</li><li class=\"service\"><strong>Security & Compliance Audits:</strong> Assess system security, performance, and compliance through detailed audits.</li><li class=\"service\"><strong>Reverse Proxy & Load Balancing:</strong> Implement and configure reverse proxies and load balancers (Nginx, Traefik).</li><li class=\"service\"><strong>Software Deployment & Management:</strong> Deploy, configure, and maintain software installations, updates, and core services.</li><li class=\"service\"><strong>Containerization & Orchestration:</strong> Configure Docker/Podman, manage Kubernetes clusters, and orchestrate container deployments.</li><li class=\"service\"><strong>CI/CD Automation:</strong> Automate application deployment pipelines using continuous integration and delivery tools.</li><li class=\"service\"><strong>Performance Monitoring:</strong> Real-time monitoring of system performance with tools like Prometheus and Grafana.</li></ul>",
    "contact": "<h2>Interested in discussing your needs?</h2>Schedule <a class=\"contact\" href=\"https://calendly.com/maximiliennadji/30min\"> an appointment directly <\/a> or <a class=\"contact\" href=\"https://www.linkedin.com/in/maximilien-nadji/\"> contact me on LinkedIn <\/a> to discuss further."
}