{
    "about_link": "À propos",
    "about_title": "Qui suis-je?",
    "short_autobiography": "Mon nom est Maximilien Nadji, je suis un ingénieur Linux en freelance adoptant la philosophie DevOps.",
    "goals": "Je poste des articles à propos du freelancing, de Linux et du DevOps.",
    "users_and_groups": "Créer, configurer et maintenir les comptes utilisateurs, leurs groupes associés, les ressources utilisateurs, les permissions utilisateurs",
    "cronjobs": "Planifier des cronjobs pour exécuter des commandes",
    "storage": "Créer, configurer et maintenir les partitions du disque, les volumes logiques (LVM), le swap, les systèmes de fichiers, l'automontage des systèmes de fichiers",
    "system_failures": "Récupération en cas de défaillance du matériel, du système d'exploitation ou du système de fichiers",
    "networking": "Configurer un pare-feu de filtrage des paquets, le réseau IPv4 et IPv6, la redirection des ports, le NAT, le routage statique et dynamique, SSH",
    "load_balancing": "Implementer des proxy inverses et des load balancers (Nginx)",
    "deployment": "Déployer, configurer et maintenir les installations logiciels, les mises à jour et les services système",
    "containers": "Configurer des conteneurs (Docker), des orchestrateurs de conteneurs (Kubernetes) créer et maintenir des conteneurs",
    "contact_title": "Intéressé.e par mes services?",
    "contact": "Prenez contact en prenant rendez-vous <a href=\"https://calendly.com/n-maximilien1/30min\"> ici <\/a> ou en me contactant sur <a href=\"https://www.linkedin.com/in/maximilien-nadji/\"> LinkedIn <\/a>.",
    "autobiography_title": "En savoir plus sur qui suis-je",
    "autobiography": "J'ai commencé à utiliser Linux durant mes études supérieures en installant Fedora 31.<br>J'avais appris avec à programmer en C, en C++, en Python, et bien sûr à créer des scripts Bash.<br><br>J'ai commencé à me spécialiser dans l'administration système Linux lors de mon précédent travail où j'étais consultant DevOps.<br>J'avais eu l'opportunité d'effectuer une formation sur site couvrant les bases ainsi que des notions avancées, et je me sentais dans mon élément.<br>Suite à cette formation, afin de confirmer mes compétences en administration système Linux, j'avais décidé de passer la certification <a href=\"https://training.linuxfoundation.org/certification/linux-foundation-certified-sysadmin-lfcs/\"> LFCS <\/a> que j'ai obtenu avec <a href=\"https://ti-user-certificates.s3.amazonaws.com/e0df7fbf-a057-42af-8a1f-590912be5460/53be41b8-832e-4e79-a468-64e10b056c27-maximilien-nadji-d2b2531b-484a-44d6-87c5-4fcdd2eddc79-certificate.pdf\"> succès <\/a>."
}