{
    "title": "Présentation",
    "presentation": "<p>Je suis Maximilien Nadji, Administrateur Système Linux favorisant la culture DevOps.<br>Je maintiens un <a href=\"/blog\">blog</a> dans lequel je poste des articles à propos de Linux, du DevOps et du freelance.</p>",
    "services": "<ul class=\"services-list\"><li class=\"service\"><strong>Gestion des utilisateurs et des groupes:</strong> Créer, configurer et gérer les comptes utilisateurs locaux, les autorisations de groupe, les limites de ressources et les ACL.</li><li class=\"service\"><strong>Planification des tâches et automatisation:</strong> Gérer et planifier des tâches récurrentes et l'exécution de commandes.</li><li class=\"service\"><strong>Gestion des disques et du stockage:</strong> Configurer et gérer les partitions de disque, le stockage LVM, l'espace swap, les systèmes de fichiers et les montages automatiques.</li><li class=\"service\"><strong>Récupération système:</strong> Récupérer efficacement après des défaillances matérielles, système d'exploitation ou de système de fichiers.</li><li class=\"service\"><strong>Configuration du réseau:</strong> Configurer le filtrage des paquets, la mise en réseau IPv4/IPv6, la redirection de ports, le NAT, le routage statique/dynamique et l'accès SSH.</li><li class=\"service\"><strong>Audits de sécurité et de conformité:</strong> Évaluer la sécurité, les performances et la conformité du système grâce à des audits détaillés.</li><li class=\"service\"><strong>Proxy inverse et équilibrage de charge:</strong> Implémenter et configurer des proxies inverses et des équilibres de charge (Nginx, Traefik).</li><li class=\"service\"><strong>Déploiement et gestion des logiciels:</strong> Déployer, configurer et maintenir les installations de logiciels, les mises à jour et les services de base.</li><li class=\"service\"><strong>Containerisation et orchestration:</strong> Configurer Docker/Podman, gérer des clusters Kubernetes et orchestrer le déploiement de containers.</li><li class=\"service\"><strong>Automatisation CI/CD:</strong> Automatiser les pipelines de déploiement d'applications à l'aide d'outils d'intégration et de livraison continues.</li><li class=\"service\"><strong>Surveillance des performances:</strong> Surveillance en temps réel des performances du système avec des outils tels que Prometheus et Grafana.</li></ul>",
    "contact": "<h2>Intéressé(e) par un échange sur vos besoins?</h2>Prenez <a href=\"https://calendly.com/maximiliennadji/30min\"> rendez-vous directement <\/a> ou <a href=\"https://www.linkedin.com/in/maximilien-nadji/\"> contactez-moi sur LinkedIn <\/a> pour échanger."}